Assignment2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0   0   0  )
    (0.2 0   0  )
    (0   0.1 0  )
    (0.2 0.1 0  )
    (0   0.2 0  )
    (0.2 0.2 0  )
    (0   0   0.1)
    (0.2 0   0.1)
    (0   0.1 0.1)
    (0.2 0.1 0.1)
    (0   0.2 0.1)
    (0.2 0.2 0.1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (44 22 1) simpleGrading (1 20 1)
    hex (2 3 5 4 8 9 11 10) (44 22 1) simpleGrading (1 0.05 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (5 4 10 11)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (3 9 7 1)
            (8 2 0 6)
            (5 11 9 3)
            (10 4 2 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (2 3 1 0)
            (9 8 6 7)
            (4 5 3 2)
            (11 10 8 9)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
